Revit 2027 API
CableSize.HotConductorSize Property
 The size of a Hot Conductor.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId HotConductorSize { get; set; }
Public Property HotConductorSize As ElementId
	Get
	Set
public:
property ElementId^ HotConductorSize {
	ElementId^ get ();
	void set (ElementId^ value);
}
member HotConductorSize : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The id is not a Conductor Size id nor invalidElementId.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 Each Hot Conductor has the same size.
See Also
Reference
CableSize Class
Autodesk.Revit.DB.Electrical Namespace